prbush/microSWIFT_V2/microSWIFT_U5A5/microSWIFT_V2_U5A5/microSWIFT_V2_U5A5.ioc
#MicroXplorer Configuration settings - do not modify
ADC4.Channel-2\#ChannelRegularConversion=ADC_CHANNEL_6
ADC4.Channel-IN=ADC_CHANNEL_VREFINT
ADC4.Channel-IN6=ADC_CHANNEL_6
ADC4.ClockPrescaler=ADC_CLOCK_ASYNC_DIV32
ADC4.CommonPathInternal=ADC_CHANNEL_VREFINT|null|null|null
ADC4.ContinuousConvMode=ENABLE
ADC4.DMAContinuousRequests=DISABLE
ADC4.DataAlign=ADC_DATAALIGN_RIGHT
ADC4.EOCSelection=ADC_EOC_SEQ_CONV
ADC4.EnableAnalogWatchDog1=false
ADC4.EnableAnalogWatchDog2=false
ADC4.EnableAnalogWatchDog3=false
ADC4.EnableRegularConversion=ENABLE
ADC4.ExternalTrigConv=ADC_SOFTWARE_START
ADC4.ExternalTrigConvEdge=ADC_EXTERNALTRIGCONVEDGE_NONE
ADC4.IPParameters=Channel-IN6,Channel-IN,ModeADC4,ClockPrescaler,Resolution,DataAlign,Sequencer,ScanConvMode,ContinuousConvMode,DMAContinuousRequests,EOCSelection,Overrun,LowPowerAutoWait,LowPowerAutoPowerOff,SamplingTimeCommon1,SamplingTimeCommon2,TriggerFrequencyMode,VrefProtection,ExternalTrigConv,ExternalTrigConvEdge,OversamplingMode,EnableRegularConversion,NbrOfConversion,EnableAnalogWatchDog1,EnableAnalogWatchDog2,EnableAnalogWatchDog3,Rank-2\#ChannelRegularConversion,Channel-2\#ChannelRegularConversion,SamplingTime-2\#ChannelRegularConversion,OffsetNumber-2\#ChannelRegularConversion,SelectedChannel,CommonPathInternal
ADC4.LowPowerAutoPowerOff=ADC_LOW_POWER_NONE
ADC4.LowPowerAutoWait=DISABLE
ADC4.ModeADC4=ADC_MODE_INDEPENDENT
ADC4.NbrOfConversion=1
ADC4.OffsetNumber-2\#ChannelRegularConversion=ADC_OFFSET_NONE
ADC4.Overrun=ADC_OVR_DATA_OVERWRITTEN
ADC4.OversamplingMode=DISABLE
ADC4.Rank-2\#ChannelRegularConversion=1
ADC4.Resolution=ADC_RESOLUTION_12B
ADC4.SamplingTime-2\#ChannelRegularConversion=ADC4_SAMPLINGTIME_COMMON_1
ADC4.SamplingTimeCommon1=ADC4_SAMPLETIME_814CYCLES_5
ADC4.SamplingTimeCommon2=ADC4_SAMPLETIME_814CYCLES_5
ADC4.ScanConvMode=ADC4_SCAN_DISABLE
ADC4.SelectedChannel=ADC_CHANNEL_6|ADC_CHANNEL_VREFINT
ADC4.Sequencer=FULLY_CONFIGURABLE
ADC4.TriggerFrequencyMode=ADC_TRIGGER_FREQ_LOW
ADC4.VrefProtection=ADC_VREF_PPROT_VREFPROT
CAD.formats=
CAD.pinconfig=
CAD.provider=
CORTEX_M33_NS.IPParameters=MPU_Control
CORTEX_M33_NS.MPU_Control=__NULL
CORTEX_M33_NS.userName=CORTEX_M33
File.Version=6
GPDMA1.BLKHWREQUEST_GPDMACH0=DMA_BREQ_SINGLE_BURST
GPDMA1.BLKHWREQUEST_GPDMACH1=DMA_BREQ_SINGLE_BURST
GPDMA1.BLKHWREQUEST_GPDMACH2=DMA_BREQ_SINGLE_BURST
GPDMA1.BLKHWREQUEST_GPDMACH3=DMA_BREQ_SINGLE_BURST
GPDMA1.BLKHWREQUEST_GPDMACH4=DMA_BREQ_SINGLE_BURST
GPDMA1.CIRCULARMODE_GPDMACH0=DISABLE
GPDMA1.CIRCULARMODE_GPDMACH1=DISABLE
GPDMA1.CIRCULARMODE_GPDMACH2=DISABLE
GPDMA1.CIRCULARMODE_GPDMACH3=DISABLE
GPDMA1.CIRCULARMODE_GPDMACH4=DISABLE
GPDMA1.ChannelPRIV_GPDMACH0=DMA_CHANNEL_PRIV
GPDMA1.ChannelPRIV_GPDMACH1=DMA_CHANNEL_NPRIV
GPDMA1.ChannelPRIV_GPDMACH2=DMA_CHANNEL_NPRIV
GPDMA1.ChannelPRIV_GPDMACH3=DMA_CHANNEL_NPRIV
GPDMA1.ChannelPRIV_GPDMACH4=DMA_CHANNEL_NPRIV
GPDMA1.DATAHANDLING_GPDMACH0=NONE
GPDMA1.DATAHANDLING_GPDMACH1=NONE
GPDMA1.DATAHANDLING_GPDMACH2=NONE
GPDMA1.DATAHANDLING_GPDMACH3=NONE
GPDMA1.DATAHANDLING_GPDMACH4=NONE
GPDMA1.DESTBURSTLENGTH_GPDMACH0=1
GPDMA1.DESTBURSTLENGTH_GPDMACH1=1
GPDMA1.DESTBURSTLENGTH_GPDMACH2=1
GPDMA1.DESTBURSTLENGTH_GPDMACH3=1
GPDMA1.DESTBURSTLENGTH_GPDMACH4=1
GPDMA1.DESTDATAWIDTH_GPDMACH0=DMA_DEST_DATAWIDTH_BYTE
GPDMA1.DESTDATAWIDTH_GPDMACH1=DMA_DEST_DATAWIDTH_BYTE
GPDMA1.DESTDATAWIDTH_GPDMACH2=DMA_DEST_DATAWIDTH_BYTE
GPDMA1.DESTDATAWIDTH_GPDMACH3=DMA_DEST_DATAWIDTH_BYTE
GPDMA1.DESTDATAWIDTH_GPDMACH4=DMA_DEST_DATAWIDTH_BYTE
GPDMA1.DESTINC_GPDMACH0=DMA_DINC_INCREMENTED
GPDMA1.DESTINC_GPDMACH1=DMA_DINC_INCREMENTED
GPDMA1.DESTINC_GPDMACH2=DMA_DINC_FIXED
GPDMA1.DESTINC_GPDMACH3=DMA_DINC_INCREMENTED
GPDMA1.DESTINC_GPDMACH4=DMA_DINC_FIXED
GPDMA1.DIRECTION_GPDMACH0=DMA_PERIPH_TO_MEMORY
GPDMA1.DIRECTION_GPDMACH1=DMA_PERIPH_TO_MEMORY
GPDMA1.DIRECTION_GPDMACH2=DMA_MEMORY_TO_PERIPH
GPDMA1.DIRECTION_GPDMACH3=DMA_PERIPH_TO_MEMORY
GPDMA1.DIRECTION_GPDMACH4=DMA_MEMORY_TO_PERIPH
GPDMA1.DMAHANDLE_GPDMACH0=hdmarx
GPDMA1.DMAHANDLE_GPDMACH1=hdmarx
GPDMA1.DMAHANDLE_GPDMACH2=hdmatx
GPDMA1.DMAHANDLE_GPDMACH3=hdmarx
GPDMA1.DMAHANDLE_GPDMACH4=hdmatx
GPDMA1.IPHANDLE_GPDMACH0-SIMPLEREQUEST_GPDMACH0=__NULL
GPDMA1.IPHANDLE_GPDMACH1-SIMPLEREQUEST_GPDMACH1=__NULL
GPDMA1.IPHANDLE_GPDMACH2-SIMPLEREQUEST_GPDMACH2=__NULL
GPDMA1.IPHANDLE_GPDMACH3-SIMPLEREQUEST_GPDMACH3=__NULL
GPDMA1.IPHANDLE_GPDMACH4-SIMPLEREQUEST_GPDMACH4=__NULL
GPDMA1.IPParameters=RECAP_GPDMACH0,IPHANDLE_GPDMACH4-SIMPLEREQUEST_GPDMACH4,IPHANDLE_GPDMACH3-SIMPLEREQUEST_GPDMACH3,IPHANDLE_GPDMACH2-SIMPLEREQUEST_GPDMACH2,IPHANDLE_GPDMACH1-SIMPLEREQUEST_GPDMACH1,IPHANDLE_GPDMACH0-SIMPLEREQUEST_GPDMACH0,RECAP_GPDMACH1,RECAP_GPDMACH2,RECAP_GPDMACH3,RECAP_GPDMACH4,ChannelPRIV_GPDMACH4,CIRCULARMODE_GPDMACH4,REQUEST_GPDMACH4,PRIORITY_GPDMACH4,MODE_GPDMACH4,DMAHANDLE_GPDMACH4,DIRECTION_GPDMACH4,BLKHWREQUEST_GPDMACH4,SRCINC_GPDMACH4,DESTINC_GPDMACH4,SRCDATAWIDTH_GPDMACH4,DESTDATAWIDTH_GPDMACH4,SRCBURSTLENGTH_GPDMACH4,DESTBURSTLENGTH_GPDMACH4,TRANSFERALLOCATEDPORTSRC_GPDMACH4,TRANSFERALLOCATEDPORTDEST_GPDMACH4,DATAHANDLING_GPDMACH4,TRIGGERPOLARITY_GPDMACH4,TRANSFEREVENTMODE_GPDMACH4,ChannelPRIV_GPDMACH3,CIRCULARMODE_GPDMACH3,REQUEST_GPDMACH3,PRIORITY_GPDMACH3,MODE_GPDMACH3,DMAHANDLE_GPDMACH3,DIRECTION_GPDMACH3,BLKHWREQUEST_GPDMACH3,SRCINC_GPDMACH3,DESTINC_GPDMACH3,SRCDATAWIDTH_GPDMACH3,DESTDATAWIDTH_GPDMACH3,SRCBURSTLENGTH_GPDMACH3,DESTBURSTLENGTH_GPDMACH3,TRANSFERALLOCATEDPORTSRC_GPDMACH3,TRANSFERALLOCATEDPORTDEST_GPDMACH3,DATAHANDLING_GPDMACH3,TRIGGERPOLARITY_GPDMACH3,TRANSFEREVENTMODE_GPDMACH3,ChannelPRIV_GPDMACH2,CIRCULARMODE_GPDMACH2,REQUEST_GPDMACH2,PRIORITY_GPDMACH2,MODE_GPDMACH2,DMAHANDLE_GPDMACH2,DIRECTION_GPDMACH2,BLKHWREQUEST_GPDMACH2,SRCINC_GPDMACH2,DESTINC_GPDMACH2,SRCDATAWIDTH_GPDMACH2,DESTDATAWIDTH_GPDMACH2,SRCBURSTLENGTH_GPDMACH2,DESTBURSTLENGTH_GPDMACH2,TRANSFERALLOCATEDPORTSRC_GPDMACH2,TRANSFERALLOCATEDPORTDEST_GPDMACH2,DATAHANDLING_GPDMACH2,TRIGGERPOLARITY_GPDMACH2,TRANSFEREVENTMODE_GPDMACH2,ChannelPRIV_GPDMACH1,CIRCULARMODE_GPDMACH1,REQUEST_GPDMACH1,PRIORITY_GPDMACH1,MODE_GPDMACH1,DMAHANDLE_GPDMACH1,DIRECTION_GPDMACH1,BLKHWREQUEST_GPDMACH1,SRCINC_GPDMACH1,DESTINC_GPDMACH1,SRCDATAWIDTH_GPDMACH1,DESTDATAWIDTH_GPDMACH1,SRCBURSTLENGTH_GPDMACH1,DESTBURSTLENGTH_GPDMACH1,TRANSFERALLOCATEDPORTSRC_GPDMACH1,TRANSFERALLOCATEDPORTDEST_GPDMACH1,DATAHANDLING_GPDMACH1,TRIGGERPOLARITY_GPDMACH1,TRANSFEREVENTMODE_GPDMACH1,ChannelPRIV_GPDMACH0,CIRCULARMODE_GPDMACH0,REQUEST_GPDMACH0,PRIORITY_GPDMACH0,MODE_GPDMACH0,DMAHANDLE_GPDMACH0,DIRECTION_GPDMACH0,BLKHWREQUEST_GPDMACH0,SRCINC_GPDMACH0,DESTINC_GPDMACH0,SRCDATAWIDTH_GPDMACH0,DESTDATAWIDTH_GPDMACH0,SRCBURSTLENGTH_GPDMACH0,DESTBURSTLENGTH_GPDMACH0,TRANSFERALLOCATEDPORTSRC_GPDMACH0,TRANSFERALLOCATEDPORTDEST_GPDMACH0,DATAHANDLING_GPDMACH0,TRIGGERPOLARITY_GPDMACH0,TRANSFEREVENTMODE_GPDMACH0
GPDMA1.MODE_GPDMACH0=DMA_NORMAL
GPDMA1.MODE_GPDMACH1=DMA_NORMAL
GPDMA1.MODE_GPDMACH2=DMA_NORMAL
GPDMA1.MODE_GPDMACH3=DMA_NORMAL
GPDMA1.MODE_GPDMACH4=DMA_NORMAL
GPDMA1.PRIORITY_GPDMACH0=DMA_LOW_PRIORITY_LOW_WEIGHT
GPDMA1.PRIORITY_GPDMACH1=DMA_LOW_PRIORITY_HIGH_WEIGHT
GPDMA1.PRIORITY_GPDMACH2=DMA_HIGH_PRIORITY
GPDMA1.PRIORITY_GPDMACH3=DMA_LOW_PRIORITY_HIGH_WEIGHT
GPDMA1.PRIORITY_GPDMACH4=DMA_HIGH_PRIORITY
GPDMA1.RECAP_GPDMACH0=GPDMA1_REQUEST_LPUART1_RX
GPDMA1.RECAP_GPDMACH1=GPDMA1_REQUEST_UART4_RX
GPDMA1.RECAP_GPDMACH2=GPDMA1_REQUEST_UART5_TX
GPDMA1.RECAP_GPDMACH3=GPDMA1_REQUEST_UART5_RX
GPDMA1.RECAP_GPDMACH4=GPDMA1_REQUEST_LPUART1_TX
GPDMA1.REQUEST_GPDMACH0=GPDMA1_REQUEST_LPUART1_RX
GPDMA1.REQUEST_GPDMACH1=GPDMA1_REQUEST_UART4_RX
GPDMA1.REQUEST_GPDMACH2=GPDMA1_REQUEST_UART5_TX
GPDMA1.REQUEST_GPDMACH3=GPDMA1_REQUEST_UART5_RX
GPDMA1.REQUEST_GPDMACH4=GPDMA1_REQUEST_LPUART1_TX
GPDMA1.SRCBURSTLENGTH_GPDMACH0=1
GPDMA1.SRCBURSTLENGTH_GPDMACH1=1
GPDMA1.SRCBURSTLENGTH_GPDMACH2=1
GPDMA1.SRCBURSTLENGTH_GPDMACH3=1
GPDMA1.SRCBURSTLENGTH_GPDMACH4=1
GPDMA1.SRCDATAWIDTH_GPDMACH0=DMA_SRC_DATAWIDTH_BYTE
GPDMA1.SRCDATAWIDTH_GPDMACH1=DMA_SRC_DATAWIDTH_BYTE
GPDMA1.SRCDATAWIDTH_GPDMACH2=DMA_SRC_DATAWIDTH_BYTE
GPDMA1.SRCDATAWIDTH_GPDMACH3=DMA_SRC_DATAWIDTH_BYTE
GPDMA1.SRCDATAWIDTH_GPDMACH4=DMA_SRC_DATAWIDTH_BYTE
GPDMA1.SRCINC_GPDMACH0=DMA_SINC_FIXED
GPDMA1.SRCINC_GPDMACH1=DMA_SINC_FIXED
GPDMA1.SRCINC_GPDMACH2=DMA_SINC_INCREMENTED
GPDMA1.SRCINC_GPDMACH3=DMA_SINC_FIXED
GPDMA1.SRCINC_GPDMACH4=DMA_SINC_INCREMENTED
GPDMA1.TRANSFERALLOCATEDPORTDEST_GPDMACH0=DMA_DEST_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTDEST_GPDMACH1=DMA_DEST_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTDEST_GPDMACH2=DMA_DEST_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTDEST_GPDMACH3=DMA_DEST_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTDEST_GPDMACH4=DMA_DEST_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTSRC_GPDMACH0=DMA_SRC_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTSRC_GPDMACH1=DMA_SRC_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTSRC_GPDMACH2=DMA_SRC_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTSRC_GPDMACH3=DMA_SRC_ALLOCATED_PORT0
GPDMA1.TRANSFERALLOCATEDPORTSRC_GPDMACH4=DMA_SRC_ALLOCATED_PORT0
GPDMA1.TRANSFEREVENTMODE_GPDMACH0=DMA_TCEM_BLOCK_TRANSFER
GPDMA1.TRANSFEREVENTMODE_GPDMACH1=DMA_TCEM_BLOCK_TRANSFER
GPDMA1.TRANSFEREVENTMODE_GPDMACH2=DMA_TCEM_BLOCK_TRANSFER
GPDMA1.TRANSFEREVENTMODE_GPDMACH3=DMA_TCEM_BLOCK_TRANSFER
GPDMA1.TRANSFEREVENTMODE_GPDMACH4=DMA_TCEM_BLOCK_TRANSFER
GPDMA1.TRIGGERPOLARITY_GPDMACH0=DMA_TRIG_POLARITY_MASKED
GPDMA1.TRIGGERPOLARITY_GPDMACH1=DMA_TRIG_POLARITY_MASKED
GPDMA1.TRIGGERPOLARITY_GPDMACH2=DMA_TRIG_POLARITY_MASKED
GPDMA1.TRIGGERPOLARITY_GPDMACH3=DMA_TRIG_POLARITY_MASKED
GPDMA1.TRIGGERPOLARITY_GPDMACH4=DMA_TRIG_POLARITY_MASKED
GPIO.groupedBy=
I2C1.AddressingMode=I2C_ADDRESSINGMODE_7BIT
I2C1.Analog_Filter=I2C_ANALOGFILTER_ENABLE
I2C1.AutonomousMode=AUTONOMOUS_MODE_DISABLE
I2C1.DualAddressMode=I2C_DUALADDRESS_DISABLE
I2C1.GeneralCallMode=I2C_GENERALCALL_DISABLE
I2C1.I2C_Coeff_DF=0
I2C1.I2C_Fall_Time=0
I2C1.I2C_Rise_Time=0
I2C1.I2C_Speed_Mode=I2C_Fast
I2C1.IPParameters=Speed,I2C_Rise_Time,I2C_Fall_Time,I2C_Coeff_DF,Analog_Filter,NoStretchMode,GeneralCallMode,AddressingMode,DualAddressMode,OwnAddress,AutonomousMode,I2C_Speed_Mode,Timing
I2C1.NoStretchMode=I2C_NOSTRETCH_DISABLE
I2C1.OwnAddress=0
I2C1.Speed=400
I2C1.Timing=0x00100413
IWDG.EWI=0
IWDG.IPParameters=Prescaler,Window,Reload,EWI
IWDG.Prescaler=IWDG_PRESCALER_512
IWDG.Reload=4094
IWDG.Window=4094
KeepUserPlacement=false
LPBAMQUEUE.IPParameters=PRIORITY,Interrupt1,Interrupt2,Interrupt3,Interrupt5,Interrupt6
LPBAMQUEUE.Interrupt1=DISABLE
LPBAMQUEUE.Interrupt2=DISABLE
LPBAMQUEUE.Interrupt3=DISABLE
LPBAMQUEUE.Interrupt5=DISABLE
LPBAMQUEUE.Interrupt6=DISABLE
LPBAMQUEUE.PRIORITY=DMA_LOW_PRIORITY_LOW_WEIGHT
LPUART1.AutonomousMode=AUTONOMOUS_MODE_DISABLE
LPUART1.BaudRate=9600
LPUART1.ClockPrescaler=UART_PRESCALER_DIV1
LPUART1.DMADisableonRxErrorParam=UART_ADVFEATURE_DMA_ENABLEONRXERROR
LPUART1.DataInvertParam=UART_ADVFEATURE_DATAINV_DISABLE
LPUART1.FIFOMode=UART_FIFOMODE_DISABLE
LPUART1.IPParameters=BaudRate,WordLength,Parity,StopBits,Mode,OneBitSampling,ClockPrescaler,FIFOMode,TXFIFOThreshold,RXFIFOThreshold,AutonomousMode,TxPinLevelInvertParam,RxPinLevelInvertParam,DataInvertParam,SwapParam,OverrunDisableParam,DMADisableonRxErrorParam,MSBFirstParam
LPUART1.MSBFirstParam=UART_ADVFEATURE_MSBFIRST_DISABLE
LPUART1.Mode=UART_MODE_TX_RX
LPUART1.OneBitSampling=UART_ONE_BIT_SAMPLE_DISABLE
LPUART1.OverrunDisableParam=UART_ADVFEATURE_OVERRUN_ENABLE
LPUART1.Parity=UART_PARITY_NONE
LPUART1.RXFIFOThreshold=UART_RXFIFO_THRESHOLD_1_8
LPUART1.RxPinLevelInvertParam=UART_ADVFEATURE_RXINV_DISABLE
LPUART1.StopBits=UART_STOPBITS_1
LPUART1.SwapParam=UART_ADVFEATURE_SWAP_DISABLE
LPUART1.TXFIFOThreshold=UART_TXFIFO_THRESHOLD_1_8
LPUART1.TxPinLevelInvertParam=UART_ADVFEATURE_TXINV_DISABLE
LPUART1.WordLength=UART_WORDLENGTH_8B
MMTAppReg1.MEMORYMAP.AP=RW_priv_only
MMTAppReg1.MEMORYMAP.AppRegionName=RAM
MMTAppReg1.MEMORYMAP.ContextName=CortexM33
MMTAppReg1.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg1.MEMORYMAP.DefaultDataRegion=true
MMTAppReg1.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ContextName,Name,AP
MMTAppReg1.MEMORYMAP.Name=RAM
MMTAppReg1.MEMORYMAP.Size=2555904
MMTAppReg1.MEMORYMAP.StartAddress=0x20000000
MMTAppReg2.MEMORYMAP.AppRegionName=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg2.MEMORYMAP.DefaultDataRegion=false
MMTAppReg2.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,ReservedRegion,Name
MMTAppReg2.MEMORYMAP.Name=RAM Reserved Alias Region
MMTAppReg2.MEMORYMAP.ReservedRegion=true
MMTAppReg2.MEMORYMAP.Size=2555904
MMTAppReg2.MEMORYMAP.StartAddress=0x0A000000
MMTAppReg3.MEMORYMAP.AP=RO_priv_only
MMTAppReg3.MEMORYMAP.AppRegionName=FLASH
MMTAppReg3.MEMORYMAP.Cacheability=WTRA
MMTAppReg3.MEMORYMAP.ContextName=CortexM33
MMTAppReg3.MEMORYMAP.CoreName=ARM Cortex-M33
MMTAppReg3.MEMORYMAP.DefaultCodeRegion=true
MMTAppReg3.MEMORYMAP.DefaultDataRegion=false
MMTAppReg3.MEMORYMAP.IPParameters=StartAddress,Size,CoreName,DefaultDataRegion,MemType,ContextName,Name,AP,Cacheability,DefaultCodeRegion
MMTAppReg3.MEMORYMAP.MemType=ROM
MMTAppReg3.MEMORYMAP.Name=FLASH
MMTAppReg3.MEMORYMAP.Size=4194304
MMTAppReg3.MEMORYMAP.StartAddress=0x08000000
MMTAppRegionsCount=3
MMTConfigApplied=false
Mcu.CPN=STM32U5A5ZJT6Q
Mcu.ContextProject=TrustZoneDisabled
Mcu.Family=STM32U5
Mcu.IP0=ADC4
Mcu.IP1=CORTEX_M33_NS
Mcu.IP10=MEMORYMAP
Mcu.IP11=NVIC
Mcu.IP12=PWR
Mcu.IP13=RCC
Mcu.IP14=RTC
Mcu.IP15=SYS
Mcu.IP16=THREADX
Mcu.IP17=TIM15
Mcu.IP18=TIM16
Mcu.IP19=TIM17
Mcu.IP2=DEBUG
Mcu.IP20=UART4
Mcu.IP21=UART5
Mcu.IP22=VREFBUF
Mcu.IP3=GPDMA1
Mcu.IP4=I2C1
Mcu.IP5=ICACHE
Mcu.IP6=IWDG
Mcu.IP7=LPBAM
Mcu.IP8=LPBAMQUEUE
Mcu.IP9=LPUART1
Mcu.IPNb=23
Mcu.Name=STM32U5A5ZJTxQ
Mcu.Package=LQFP144
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN (PC14)
Mcu.Pin10=PB14
Mcu.Pin11=PB15
Mcu.Pin12=PG2
Mcu.Pin13=PG3
Mcu.Pin14=PG4
Mcu.Pin15=PC7
Mcu.Pin16=PA9
Mcu.Pin17=PA10
Mcu.Pin18=PA13 (JTMS/SWDIO)
Mcu.Pin19=PA14 (JTCK/SWCLK)
Mcu.Pin2=PC15-OSC32_OUT (PC15)
Mcu.Pin20=PA15 (JTDI)
Mcu.Pin21=PC10
Mcu.Pin22=PC11
Mcu.Pin23=PC12
Mcu.Pin24=PD0
Mcu.Pin25=PD1
Mcu.Pin26=PD2
Mcu.Pin27=PD3
Mcu.Pin28=PD4
Mcu.Pin29=PD5
Mcu.Pin3=PF0
Mcu.Pin30=PD6
Mcu.Pin31=PD7
Mcu.Pin32=PG9
Mcu.Pin33=PG10
Mcu.Pin34=PG12
Mcu.Pin35=PG13
Mcu.Pin36=PG14
Mcu.Pin37=PB3 (JTDO/TRACESWO)
Mcu.Pin38=PB5
Mcu.Pin39=PB7
Mcu.Pin4=PF1
Mcu.Pin40=VP_ADC4_Vref_Input
Mcu.Pin41=VP_GPDMA1_VS_GPDMACH0
Mcu.Pin42=VP_GPDMA1_VS_GPDMACH1
Mcu.Pin43=VP_GPDMA1_VS_GPDMACH2
Mcu.Pin44=VP_GPDMA1_VS_GPDMACH3
Mcu.Pin45=VP_GPDMA1_VS_GPDMACH4
Mcu.Pin46=VP_ICACHE_VS_ICACHE
Mcu.Pin47=VP_IWDG_VS_IWDG
Mcu.Pin48=VP_LPBAMQUEUE_VS_QUEUE
Mcu.Pin49=VP_PWR_VS_DBSignals
Mcu.Pin5=PF2
Mcu.Pin50=VP_PWR_VS_SECSignals
Mcu.Pin51=VP_PWR_VS_LPOM
Mcu.Pin52=VP_PWR_Vdda
Mcu.Pin53=VP_RTC_VS_RTC_Activate
Mcu.Pin54=VP_RTC_VS_RTC_Calendar
Mcu.Pin55=VP_SYS_VS_tim4
Mcu.Pin56=VP_THREADX_VS_RTOSJjThreadXJjCoreJjDefault
Mcu.Pin57=VP_TIM15_VS_ClockSourceINT
Mcu.Pin58=VP_TIM16_VS_ClockSourceINT
Mcu.Pin59=VP_TIM17_VS_ClockSourceINT
Mcu.Pin6=VREF+
Mcu.Pin60=VP_LPBAM_VS_SIG1
Mcu.Pin61=VP_LPBAM_VS_SIG4
Mcu.Pin62=VP_MEMORYMAP_VS_MEMORYMAP
Mcu.Pin7=PA2
Mcu.Pin8=PA3
Mcu.Pin9=PF15
Mcu.PinsNb=63
Mcu.ThirdPartyNb=0
Mcu.UserConstants=ADC_MICROVOLTS_PER_BIT,3292
Mcu.UserName=STM32U5A5ZJTxQ
MxCube.Version=6.10.0
MxDb.Version=DB.6.0.100
NVIC.ADC4_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.GPDMA1_Channel0_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false\:true
NVIC.GPDMA1_Channel1_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false\:true
NVIC.GPDMA1_Channel2_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false\:true
NVIC.GPDMA1_Channel3_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false\:true
NVIC.GPDMA1_Channel4_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:false\:true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.IWDG_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.LPUART1_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_3
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false\:false
NVIC.SavedPendsvIrqHandlerGenerated=false
NVIC.SavedSvcallIrqHandlerGenerated=false
NVIC.SavedSystickIrqHandlerGenerated=false
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:true\:false
NVIC.TIM15_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TIM16_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TIM17_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TIM4_IRQn=true\:7\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.TimeBase=TIM4_IRQn
NVIC.TimeBaseIP=TIM4
NVIC.UART4_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.UART5_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true\:true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false\:false
PA10.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label
PA10.GPIO_Label=USART1_RX
PA10.GPIO_PuPd=GPIO_PULLDOWN
PA10.GPIO_Speed=GPIO_SPEED_FREQ_VERY_HIGH
PA10.Locked=true
PA10.Signal=USART1_RX
PA13\ (JTMS/SWDIO).Locked=true
PA13\ (JTMS/SWDIO).Mode=Trace_Asynchronous_SW
PA13\ (JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PA14\ (JTCK/SWCLK).Locked=true
PA14\ (JTCK/SWCLK).Mode=Trace_Asynchronous_SW
PA14\ (JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PA15\ (JTDI).GPIOParameters=GPIO_Label
PA15\ (JTDI).GPIO_Label=UCPD1_CC1
PA15\ (JTDI).Locked=true
PA15\ (JTDI).Signal=UCPD1_CC1
PA2.GPIOParameters=GPIO_Label
PA2.GPIO_Label=GNSS_UART_TX
PA2.Mode=Asynchronous
PA2.Signal=LPUART1_TX
PA3.GPIOParameters=GPIO_Label
PA3.GPIO_Label=GNSS_UART_RX
PA3.Mode=Asynchronous
PA3.Signal=LPUART1_RX
PA9.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Label
